{
  "id": 268,
  "date": "2016-04-08T00:00:00",
  "date_gmt": "2016-04-08T00:00:00",
  "guid": { "rendered": "https://pmegtrading.com/product/planer/" },
  "modified": "2017-06-21T16:08:24",
  "modified_gmt": "2017-06-21T16:08:24",
  "slug": "planer",
  "status": "publish",
  "type": "product",
  "link": "https://pmegtrading.com/product/planer",
  "title": { "rendered": "Planer" },
  "content": {
    "rendered": "<div class=\"row\">\n<div class=\"col-xs-12\">\n<p>Cut and mill concrete and asphalt with the controlled removal process of the planer attachment.</p>\n<p>The milling process involves low angle, high velocity blows in a controlled pattern that uniformly chips pavement. Depth, width, and slope control are easily set and maintained by the operator. Milled material can be immediately recycled, nicely finishing any asphalt and repair jobs. The Bobcat® planer attachment is much less expensive to maintain and more maneuverable than dedicated planers.</p>\n<p>The planer attachment is versatile and durable, delivering high torque for maximum cutting and milling performance. Choose from three different planer models listed below.</p>\n<p>Standard flow planer provides excellent performance on standard flow machines allowing a lower initial investment for those that only need to use a planer periodically. High flow planers utilize the increased hydraulic horsepower available for high production needs.</p>\n</div>\n</div>\n<div class=\"clearfix\"></div>\n<div class=\"row\">\n<div class=\"col-xs-12\">\n<h2>Top Tasks</h2>\n<ul>\n<li>Mate uneven pavement surfaces</li>\n<li>Clean up around larger miller machines</li>\n<li>Cut drainage in a parking lot</li>\n<li>Mill around manholes</li>\n<li>Taper edges on a roadway</li>\n</ul>\n</div>\n</div>\n<div class=\"clearfix\"></div>\n<div class=\"row\">\n<div class=\"col-xs-12\">\n<h2>How It Works</h2>\n<p>Carbide-tipped bits are mounted on a revolving drum to cut and pulverize pavement material. After material has been milled, it leaves the planer housing through a rear opening.</p>\n<p>Planer skis are used to adjust the angle and depth by moving the right and left ski up or down. Depth gauges are visible from the cab to provide a measurement reference of each ski depth. Bobcat planers have better visibility of the skis, so operators can easily control the path of the planer and the machine. Even on rough terrain, the planer skis maintain surface contact, resulting in a consistent cut depth.</p>\n</div>\n</div>\n<div class=\"clearfix\"></div>\n<div class=\"row\">\n<div class=\"col-xs-12\">\n<h2>Features</h2>\n<p>Drum Options: Multiple drum options to match your job needs.</p>\n<p><strong>14-24-Inch Models</strong></p>\n<ul>\n<li><strong>Oscillation</strong>: Housing oscillates up to  +/- 15 degrees allowing the operator the ability to cut necessary angles or match two uneven surfaces.</li>\n<li><strong>Replaceable Ski Wear Pads</strong>: Make maintenance easier and more affordable.</li>\n<li><strong>Steel Wheels</strong>: Mounted on the rear, wheels provide support and reduce tire bounce for a smoother cut.</li>\n<li><strong>Independently Adjustable Skis</strong>: Fingertip controls from the operator’s seat provide depth and angle control for a consistent-depth cut. Also, skis push debris away, keeping the skids in contact with the cutting surface.</li>\n<li><strong>Side Cutting Teeth</strong>: Decreases drum binding in the cut for smoother operation and provides a vertical edge for improving the joint bond between new and existing road layers.</li>\n<li><strong>Free Floating Oscillation</strong>: The cutting wheel oscillates side to side to provide optimum surface tracking regardless of loader movements, so even if the loader tires fall into a hole or depression it will cut evenly. With the Bobcat planer, pavement milling is a controlled process as the depth, width, and slope are easily set and controlled by the operator.</li>\n<li><strong>Hydraulic Side Shift</strong>: Side shifting allows milling outside the width of the carrier, making possible flush cutting adjacent to curbs and walls.</li>\n<li><strong>Large Rear Opening</strong>: Reduces the amount of material being re-milled, increasing productivity because more material can be removed from the planer before it is reground into smaller pieces.</li>\n<li><strong>Removable End Plate</strong>: As the only manufacturer of this feature, Bobcat allows the planer to mill flush against wall with no further clean-up work required.</li>\n<li><strong>Visible Left Ski</strong>: Keeps the planer centered and provides easier control over its path.</li>\n<li><strong>Top Access Panel</strong>: To inspect and replace cutting bits, a top access panel allows for easy inspection and saves maintenance time. Planer bits can be changed and removed using the specially designed bit tool.</li>\n<li><strong>Planer Drum</strong>: One-piece concentric unit made for better durability and smooth cutting.</li>\n</ul>\n<p><strong>18- and 24-Inch Models</strong></p>\n<ul>\n<li><strong>Priority Valve</strong>: Diverts oil to depth function without causing momentary loss of power to planer drum, allowing the operator to make adjustments on-the-go without sacrificing cutting power.</li>\n</ul>\n<p><strong>40-Inch High Flow Model</strong></p>\n<ul>\n<li><strong>Diverter Valve</strong>: Allows the operator to switch between hydraulic side-shift and hydraulic oscillation functions.</li>\n<li><strong>Front Access Panel</strong>: To inspect and replace cutting bits, a front access panel allows for easy inspection and saves maintenance time.</li>\n<li><strong>Hydraulic Side Shift</strong>: Side shifting allows milling outside the width of the carrier, making possible flush cutting adjacent to curbs and walls.</li>\n<li><strong>Two Direct-Drive Motors</strong>: With one on each side of the drum, the two motors increase torque force which provides an increase in productivity and life of the planer.</li>\n</ul>\n</div>\n</div>\n<p style=\"text-align: center;\"><a href=\"https://pmegtrading.com/wp-content/uploads/2016/04/Planer-Brochure_EN.pdf\" target=\"_blank\" class=\"button primary is-primary is-medium\" rel=\"noopener\"  >\n    <span>Planer Attachment Brochure<br />\n</span>\n  </a>\n\n",
    "protected": false
  },
  "excerpt": {
    "rendered": "<ul>\n<li>Transform your loader into an efficient, cost-effective milling machine</li>\n<li>Ideal for street repairs, matching uneven pavement surfaces, cutting drainage in parking lots and cleaning up around larger milling machines</li>\n<li>Multiple drum types and sizes are available for most planers</li>\n<li>Choose from standard or high-flow models</li>\n</ul>\n<p> </p>\n",
    "protected": false
  },
  "featured_media": 269,
  "comment_status": "closed",
  "ping_status": "open",
  "template": "",
  "meta": [],
  "product_cat": [8, 27],
  "product_tag": [],
  "_links": {
    "self": [{ "href": "https://pmegtrading.com/wp-json/wp/v2/product/268" }],
    "collection": [{ "href": "https://pmegtrading.com/wp-json/wp/v2/product" }],
    "about": [
      { "href": "https://pmegtrading.com/wp-json/wp/v2/types/product" }
    ],
    "replies": [
      {
        "embeddable": true,
        "href": "https://pmegtrading.com/wp-json/wp/v2/comments?post=268"
      }
    ],
    "wp:featuredmedia": [
      {
        "embeddable": true,
        "href": "https://pmegtrading.com/wp-json/wp/v2/media/269"
      }
    ],
    "wp:attachment": [
      { "href": "https://pmegtrading.com/wp-json/wp/v2/media?parent=268" }
    ],
    "wp:term": [
      {
        "taxonomy": "product_cat",
        "embeddable": true,
        "href": "https://pmegtrading.com/wp-json/wp/v2/product_cat?post=268"
      },
      {
        "taxonomy": "product_tag",
        "embeddable": true,
        "href": "https://pmegtrading.com/wp-json/wp/v2/product_tag?post=268"
      }
    ],
    "curies": [
      { "name": "wp", "href": "https://api.w.org/{rel}", "templated": true }
    ]
  }
}
